; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v7)
             (pred_11 ?v12 ?v2)
             (pred_8 ?v8 ?v2)
             (pred_10 ?v1 ?v8 )
	     (pred_2 ?v8)
             (pred_5 ?v13)
             (pred_6 ?v12)
             (pred_9 ?v2)
             (pred_1 ?v8)
             (pred_3 ?v12)
             (pred_7 ?v8)
             (pred_12 ))



(:action op_4
:parameters (?v10 ?v4 ?v11 ?v3)
:precondition (and (pred_5 ?v10) (pred_5 ?v4) (pred_6 ?v11) (pred_9 ?v3)
          (pred_4 ?v10 ?v4) (pred_11 ?v11 ?v3)
                   (pred_8 ?v4 ?v3) (pred_2 ?v10) 
                   (pred_1 ?v4) (pred_3 ?v11))
:effect (and  (pred_7 ?v4) (not (pred_1 ?v4))))


(:action op_3
:parameters (?v10 ?v6)
:precondition (and (pred_5 ?v10) (pred_5 ?v6)
               (pred_2 ?v10) (pred_4 ?v10 ?v6) (pred_7 ?v6))
:effect (and (pred_2 ?v6) (not (pred_2 ?v10))))

(:action op_2
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_6 ?v11) 
                  (pred_2 ?v10) (pred_10 ?v11 ?v10) (pred_12 ))
:effect (and (pred_3 ?v11)
   (not (pred_10 ?v11 ?v10)) (not (pred_12 ))))


(:action op_1
:parameters (?v10 ?v5 ?v9)
:precondition (and (pred_5 ?v10) (pred_6 ?v5) (pred_6 ?v9)
                  (pred_2 ?v10) (pred_3 ?v9) (pred_10 ?v5 ?v10))
:effect (and (pred_3 ?v5) (pred_10 ?v9 ?v10)
        (not (pred_3 ?v9)) (not (pred_10 ?v5 ?v10))))

(:action op_5
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_6 ?v11) 
                  (pred_2 ?v10) (pred_3 ?v11))
:effect (and (pred_12 ) (pred_10 ?v11 ?v10) (not (pred_3 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_07 obj_05 obj_31 obj_12 obj_01 obj_10 obj_20 obj_09 obj_15 obj_04 obj_16 obj_24 obj_18 obj_06 obj_14 obj_23 obj_02 obj_25 obj_27 obj_13 obj_28 obj_21 obj_17 obj_08
    obj_03 obj_29 obj_30
    obj_11 obj_19 obj_26 obj_32
    )

    (:init
       (pred_12)

       (pred_5 obj_22)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_31)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_10)
       (pred_5 obj_20)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_04)
       (pred_5 obj_16)
       (pred_5 obj_24)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_23)
       (pred_5 obj_02)
       (pred_5 obj_25)
       (pred_5 obj_27)
       (pred_5 obj_13)
       (pred_5 obj_28)
       (pred_5 obj_21)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_9 obj_03)
       (pred_9 obj_29)
       (pred_9 obj_30)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_26)
       (pred_6 obj_32)

       (pred_4 obj_22 obj_01)
       (pred_4 obj_22 obj_07)
       (pred_4 obj_07 obj_10)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_07 obj_22)
       (pred_4 obj_05 obj_20)
       (pred_4 obj_05 obj_31)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_31 obj_09)
       (pred_4 obj_31 obj_12)
       (pred_4 obj_31 obj_05)
       (pred_4 obj_12 obj_15)
       (pred_4 obj_12 obj_31)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_01 obj_10)
       (pred_4 obj_01 obj_22)
       (pred_4 obj_10 obj_16)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_10 obj_01)
       (pred_4 obj_20 obj_24)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_20 obj_05)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_15)
       (pred_4 obj_09 obj_31)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_15 obj_12)
       (pred_4 obj_15 obj_09)
       (pred_4 obj_04 obj_14)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_16 obj_23)
       (pred_4 obj_16 obj_24)
       (pred_4 obj_16 obj_10)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_24 obj_02)
       (pred_4 obj_24 obj_18)
       (pred_4 obj_24 obj_20)
       (pred_4 obj_24 obj_16)
       (pred_4 obj_18 obj_25)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_18 obj_24)
       (pred_4 obj_06 obj_27)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_14 obj_23)
       (pred_4 obj_14 obj_04)
       (pred_4 obj_23 obj_28)
       (pred_4 obj_23 obj_02)
       (pred_4 obj_23 obj_16)
       (pred_4 obj_23 obj_14)
       (pred_4 obj_02 obj_21)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_02 obj_24)
       (pred_4 obj_02 obj_23)
       (pred_4 obj_25 obj_17)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_25 obj_18)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_27 obj_08)
       (pred_4 obj_27 obj_06)
       (pred_4 obj_27 obj_25)
       (pred_4 obj_13 obj_28)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_28 obj_21)
       (pred_4 obj_28 obj_23)
       (pred_4 obj_28 obj_13)
       (pred_4 obj_21 obj_17)
       (pred_4 obj_21 obj_02)
       (pred_4 obj_21 obj_28)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_17 obj_25)
       (pred_4 obj_17 obj_21)
       (pred_4 obj_08 obj_27)
       (pred_4 obj_08 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_15)
       (pred_1 obj_21)
       (pred_1 obj_07)
       (pred_8  obj_01 obj_03)
       (pred_8  obj_15 obj_29)
       (pred_8  obj_21 obj_30)
       (pred_8  obj_07 obj_30)
       (pred_7 obj_22)
       (pred_7 obj_05)
       (pred_7 obj_31)
       (pred_7 obj_12)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_16)
       (pred_7 obj_24)
       (pred_7 obj_18)
       (pred_7 obj_06)
       (pred_7 obj_14)
       (pred_7 obj_23)
       (pred_7 obj_02)
       (pred_7 obj_25)
       (pred_7 obj_27)
       (pred_7 obj_13)
       (pred_7 obj_28)
       (pred_7 obj_17)
       (pred_7 obj_08)

       (pred_11  obj_11 obj_03)
       (pred_11  obj_19 obj_29)
       (pred_11  obj_26 obj_30)
       (pred_11  obj_32 obj_03)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_19 obj_04)
       (pred_10 obj_26 obj_12)
       (pred_10 obj_32 obj_25)
       (pred_2 obj_20)
    )

    (:goal (and
       (pred_10 obj_11 obj_23)
       (pred_10 obj_26 obj_17)
    ))
(:constraints
  (always (not (pred_2 obj_02)))
)
)

; plan
1. (op_3 obj_20 obj_09)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_09)
   goals met: 0 of 2
2. (op_3 obj_09 obj_31)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_31)
   goals met: 0 of 2
3. (op_3 obj_31 obj_12)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_12)
   goals met: 0 of 2
4. (op_2 obj_12 obj_26)
   deleted: (pred_10 obj_26 obj_12) (pred_12)
   added: (pred_3 obj_26)
   goals met: 0 of 2
5. (op_3 obj_12 obj_31)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_31)
   goals met: 0 of 2
6. (op_3 obj_31 obj_09)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_09)
   goals met: 0 of 2
7. (op_3 obj_09 obj_18)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_18)
   goals met: 0 of 2
8. (op_3 obj_18 obj_25)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_25)
   goals met: 0 of 2
9. (op_3 obj_25 obj_17)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_17)
   goals met: 0 of 2
10. (op_4 obj_17 obj_21 obj_26 obj_30)
   deleted: (pred_1 obj_21)
   added: (pred_7 obj_21)
   goals met: 0 of 2
11. (op_5 obj_17 obj_26)
   deleted: (pred_3 obj_26)
   added: (pred_12) (pred_10 obj_26 obj_17)
   goals met: 1 of 2
12. (op_3 obj_17 obj_21)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_21)
   goals met: 1 of 2
13. (op_3 obj_21 obj_28)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_28)
   goals met: 1 of 2
14. (op_3 obj_28 obj_13)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_13)
   goals met: 1 of 2
15. (op_2 obj_13 obj_11)
   deleted: (pred_10 obj_11 obj_13) (pred_12)
   added: (pred_3 obj_11)
   goals met: 1 of 2
16. (op_3 obj_13 obj_14)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_14)
   goals met: 1 of 2
17. (op_3 obj_14 obj_23)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_23)
   goals met: 1 of 2
18. (op_5 obj_23 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_12) (pred_10 obj_11 obj_23)
   goals met: 2 of 2
